content/posts/2019-08-12-motivation.org
#+TITLE: Motivating Programmers
#+DATE: [2019-08-12]
#+STARTUP: showall
#+OPTIONS: auto-id:t

[[https://www.se-radio.net/][Software Engineering Radio]] has recently published a terrific podcast about
[[https://www.se-radio.net/2019/07/episode-374-marcus-blankenship-on-motivating-programmers/][Motivating Programmers]]. Topics include:

- That the relationship between a manager and a programmer is a strong indicator for
  employee turnover
- Why 1:1s should include the expectations and goals of both parties
- That job promotions could be implemented using small experiments and trial
- Why a manager should not be afraid to ask "are you searching for a new job?"
