posts/2019-08-12-motivation/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Motivating Programmers</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="Florian Winkelbauer">
<link rel="stylesheet" href="/site.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="/">Home</a>
<a href="/notes">Notes</a>
<a href="/posts">Posts</a>
<a href="/projects">Projects</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Motivating Programmers</h1>
</header><p>
<a href="https://www.se-radio.net/">Software Engineering Radio</a> has recently published a terrific podcast about
<a href="https://www.se-radio.net/2019/07/episode-374-marcus-blankenship-on-motivating-programmers/">Motivating Programmers</a>. Topics include:
</p>

<ul class="org-ul">
<li>That the relationship between a manager and a programmer is a strong indicator for
employee turnover</li>
<li>Why 1:1s should include the expectations and goals of both parties</li>
<li>That job promotions could be implemented using small experiments and trial</li>
<li>Why a manager should not be afraid to ask "are you searching for a new job?"</li>
</ul>
</div>
<div id="postamble" class="status">
<p class="date">Published: 2019-08-12</p>
<footer>
<p>Copyright 2023, Florian Winkelbauer. All rights reserved.</p>
</footer>
</div>
</body>
</html>